{"keras_version": "2.1.2", "backend": "tensorflow", "config": {"name": "model_1", "input_layers": [["input_3", 0, 0], ["input_2", 0, 0]], "output_layers": [["up_sampling2d_3", 0, 0]], "layers": [{"name": "input_3", "config": {"name": "input_3", "batch_input_shape": [null, 256, 256, 1], "sparse": false, "dtype": "float32"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "conv2d_204", "config": {"kernel_size": [3, 3], "trainable": true, "filters": 64, "strides": [2, 2], "name": "conv2d_204", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu"}, "inbound_nodes": [[["input_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_205", "config": {"kernel_size": [3, 3], "trainable": true, "filters": 128, "strides": [1, 1], "name": "conv2d_205", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu"}, "inbound_nodes": [[["conv2d_204", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_206", "config": {"kernel_size": [3, 3], "trainable": true, "filters": 128, "strides": [2, 2], "name": "conv2d_206", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu"}, "inbound_nodes": [[["conv2d_205", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_207", "config": {"kernel_size": [3, 3], "trainable": true, "filters": 256, "strides": [1, 1], "name": "conv2d_207", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu"}, "inbound_nodes": [[["conv2d_206", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_208", "config": {"kernel_size": [3, 3], "trainable": true, "filters": 256, "strides": [2, 2], "name": "conv2d_208", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu"}, "inbound_nodes": [[["conv2d_207", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_209", "config": {"kernel_size": [3, 3], "trainable": true, "filters": 512, "strides": [1, 1], "name": "conv2d_209", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu"}, "inbound_nodes": [[["conv2d_208", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "input_2", "config": {"name": "input_2", "batch_input_shape": [null, 1000], "sparse": false, "dtype": "float32"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "conv2d_210", "config": {"kernel_size": [3, 3], "trainable": true, "filters": 512, "strides": [1, 1], "name": "conv2d_210", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu"}, "inbound_nodes": [[["conv2d_209", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "repeat_vector_1", "config": {"name": "repeat_vector_1", "n": 1024, "trainable": true}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "RepeatVector"}, {"name": "conv2d_211", "config": {"kernel_size": [3, 3], "trainable": true, "filters": 256, "strides": [1, 1], "name": "conv2d_211", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu"}, "inbound_nodes": [[["conv2d_210", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "reshape_1", "config": {"name": "reshape_1", "trainable": true, "target_shape": [32, 32, 1000]}, "inbound_nodes": [[["repeat_vector_1", 0, 0, {}]]], "class_name": "Reshape"}, {"name": "concatenate_1", "config": {"name": "concatenate_1", "trainable": true, "axis": 3}, "inbound_nodes": [[["conv2d_211", 0, 0, {}], ["reshape_1", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "conv2d_212", "config": {"kernel_size": [1, 1], "trainable": true, "filters": 256, "strides": [1, 1], "name": "conv2d_212", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu"}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_213", "config": {"kernel_size": [3, 3], "trainable": true, "filters": 128, "strides": [1, 1], "name": "conv2d_213", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu"}, "inbound_nodes": [[["conv2d_212", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "up_sampling2d_1", "config": {"name": "up_sampling2d_1", "trainable": true, "data_format": "channels_last", "size": [2, 2]}, "inbound_nodes": [[["conv2d_213", 0, 0, {}]]], "class_name": "UpSampling2D"}, {"name": "conv2d_214", "config": {"kernel_size": [3, 3], "trainable": true, "filters": 64, "strides": [1, 1], "name": "conv2d_214", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu"}, "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "up_sampling2d_2", "config": {"name": "up_sampling2d_2", "trainable": true, "data_format": "channels_last", "size": [2, 2]}, "inbound_nodes": [[["conv2d_214", 0, 0, {}]]], "class_name": "UpSampling2D"}, {"name": "conv2d_215", "config": {"kernel_size": [3, 3], "trainable": true, "filters": 32, "strides": [1, 1], "name": "conv2d_215", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu"}, "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_216", "config": {"kernel_size": [3, 3], "trainable": true, "filters": 16, "strides": [1, 1], "name": "conv2d_216", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu"}, "inbound_nodes": [[["conv2d_215", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_217", "config": {"kernel_size": [3, 3], "trainable": true, "filters": 2, "strides": [1, 1], "name": "conv2d_217", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "tanh"}, "inbound_nodes": [[["conv2d_216", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "up_sampling2d_3", "config": {"name": "up_sampling2d_3", "trainable": true, "data_format": "channels_last", "size": [2, 2]}, "inbound_nodes": [[["conv2d_217", 0, 0, {}]]], "class_name": "UpSampling2D"}]}, "class_name": "Model"}