{"config": [{"config": {"sparse": false, "name": "input_1", "dtype": "float32", "batch_input_shape": [null, 256, 256, 1]}, "class_name": "InputLayer"}, {"config": {"filters": 64, "kernel_size": [3, 3], "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_1", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"filters": 64, "kernel_size": [3, 3], "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "strides": [2, 2], "name": "conv2d_2", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"filters": 128, "kernel_size": [3, 3], "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_3", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"filters": 128, "kernel_size": [3, 3], "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "strides": [2, 2], "name": "conv2d_4", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"filters": 256, "kernel_size": [3, 3], "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_5", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"filters": 256, "kernel_size": [3, 3], "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "strides": [2, 2], "name": "conv2d_6", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"filters": 512, "kernel_size": [3, 3], "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_7", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"filters": 256, "kernel_size": [3, 3], "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_8", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"filters": 128, "kernel_size": [3, 3], "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_9", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"name": "up_sampling2d_1", "size": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "UpSampling2D"}, {"config": {"filters": 64, "kernel_size": [3, 3], "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_10", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"name": "up_sampling2d_2", "size": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "UpSampling2D"}, {"config": {"filters": 32, "kernel_size": [3, 3], "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_11", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"filters": 2, "kernel_size": [3, 3], "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_12", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "tanh"}, "class_name": "Conv2D"}, {"config": {"name": "up_sampling2d_3", "size": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "UpSampling2D"}], "keras_version": "2.1.2", "backend": "tensorflow", "class_name": "Sequential"}