{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_3", "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_3", "sparse": false, "batch_input_shape": [null, 256, 256, 1]}, "inbound_nodes": []}, {"name": "conv2d_204", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "name": "conv2d_204", "strides": [2, 2], "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "conv2d_205", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "name": "conv2d_205", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["conv2d_204", 0, 0, {}]]]}, {"name": "conv2d_206", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "name": "conv2d_206", "strides": [2, 2], "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["conv2d_205", 0, 0, {}]]]}, {"name": "conv2d_207", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "name": "conv2d_207", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["conv2d_206", 0, 0, {}]]]}, {"name": "conv2d_208", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "name": "conv2d_208", "strides": [2, 2], "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["conv2d_207", 0, 0, {}]]]}, {"name": "conv2d_209", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "name": "conv2d_209", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["conv2d_208", 0, 0, {}]]]}, {"name": "input_2", "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_2", "sparse": false, "batch_input_shape": [null, 1000]}, "inbound_nodes": []}, {"name": "conv2d_210", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "name": "conv2d_210", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["conv2d_209", 0, 0, {}]]]}, {"name": "repeat_vector_1", "class_name": "RepeatVector", "config": {"name": "repeat_vector_1", "trainable": true, "n": 1024}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "conv2d_211", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "name": "conv2d_211", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["conv2d_210", 0, 0, {}]]]}, {"name": "reshape_1", "class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "target_shape": [32, 32, 1000]}, "inbound_nodes": [[["repeat_vector_1", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": 3}, "inbound_nodes": [[["conv2d_211", 0, 0, {}], ["reshape_1", 0, 0, {}]]]}, {"name": "conv2d_212", "class_name": "Conv2D", "config": {"kernel_size": [1, 1], "name": "conv2d_212", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "conv2d_213", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "name": "conv2d_213", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["conv2d_212", 0, 0, {}]]]}, {"name": "up_sampling2d_1", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_1", "data_format": "channels_last", "size": [2, 2], "trainable": true}, "inbound_nodes": [[["conv2d_213", 0, 0, {}]]]}, {"name": "conv2d_214", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "name": "conv2d_214", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]]}, {"name": "up_sampling2d_2", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_2", "data_format": "channels_last", "size": [2, 2], "trainable": true}, "inbound_nodes": [[["conv2d_214", 0, 0, {}]]]}, {"name": "conv2d_215", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "name": "conv2d_215", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]]}, {"name": "conv2d_216", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "name": "conv2d_216", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["conv2d_215", 0, 0, {}]]]}, {"name": "conv2d_217", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "name": "conv2d_217", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "tanh", "filters": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["conv2d_216", 0, 0, {}]]]}, {"name": "up_sampling2d_3", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_3", "data_format": "channels_last", "size": [2, 2], "trainable": true}, "inbound_nodes": [[["conv2d_217", 0, 0, {}]]]}], "output_layers": [["up_sampling2d_3", 0, 0]], "input_layers": [["input_3", 0, 0], ["input_2", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.1.2"}